---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType.Exterior
enum: Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType
source: html/92c3fafa-996d-cca9-cc7e-a73d4c94ae57.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeSegmentEndReferenceType.Exterior

Refers to the farthest point on the arc of the bend. Assuming the
 bend is 90 degrees or more, an Exterior constraint will be longer than a
 Straight constraint by an amount equal to the bend radius.